In [1]:
import numpy as np
import pandas as pd
heroes_information = pd.read_csv("heroes_information.csv")

In [2]:
###instalar desde anaconda navigator######
####pandasql
####mysql
####mysql-connector-c
####mysql-connector-python
from pandasql import *

In [3]:
####para enlistar los documentos en el directorio#####
os.listdir()

['SQL Competition.ipynb', 'heroes_information.csv', '.ipynb_checkpoints']

In [4]:
pysqldf = lambda q: sqldf(q,globals())

In [7]:
query1 = "SELECT * FROM heroes_information limit 5"

In [8]:
pysqldf(query1)

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,0,A-Bomb,Male,yellow,Human,No Hair,203.0,Marvel Comics,None,good,441.0
1,1,Abe Sapien,Male,blue,Icthyo Sapien,No Hair,191.0,Dark Horse Comics,blue,good,65.0
2,2,Abin Sur,Male,blue,Ungaran,No Hair,185.0,DC Comics,red,good,90.0
3,3,Abomination,Male,green,Human / Radiation,No Hair,203.0,Marvel Comics,None,bad,441.0
4,4,Abraxas,Male,blue,Cosmic Entity,Black,-99.0,Marvel Comics,None,bad,-99.0

In [9]:
query2 = """
SELECT Count(Distinct Publisher)
FROM heroes_information

"""

In [10]:
pysqldf(query2)

   Count(Distinct Publisher)
0                         24

In [11]:
query3 = """
SELECT Count(*)
FROM heroes_information
WHERE Height>200;

"""

In [12]:
pysqldf(query3)

   Count(*)
0        59

In [13]:
query4 = """
SELECT Count(*)
FROM heroes_information
WHERE Race='Human'
And Height > 200;

"""

In [14]:
pysqldf(query4)

   Count(*)
0        12

In [15]:
query5 = """
SELECT Count(*)
FROM heroes_information
WHERE Weight>100
AND Weight < 200;

"""

In [16]:
pysqldf(query5)

   Count(*)
0        98

In [17]:
query6 = """
SELECT Count(*)
FROM heroes_information
WHERE `Eye Color`='blue'
Or `Eye Color` ='red';

"""

In [18]:
pysqldf(query6)

   Count(*)
0       271

In [21]:
query7 = """
SELECT Count(*)
FROM heroes_information
WHERE (Race IN ('Human','Mutant') And `Hair color` = 'Green')
Or (Race = 'Vampire' AND `Hair color` = 'Black');

"""

In [22]:
pysqldf(query7)

   Count(*)
0         5

In [23]:
query8 = """
SELECT *
FROM heroes_information
Order By Race
Desc
limit 1;

"""

In [24]:
pysqldf(query8)

,id,name,Gender,Eye color,Race,Hair color,Height,Publisher,Skin color,Alignment,Weight
0,611,Solomon Grundy,Male,black,Zombie,White,279.0,DC Comics,None,bad,437.0

In [7]:
query9 = """
SELECT Gender, Count(*)
FROM heroes_information
Group By Gender;

"""

In [8]:
pysqldf(query9)

   Gender  Count(*)
0    None        29
1  Female       200
2    Male       505

In [33]:
query10 = """
SELECT COUNT(*)
FROM (
    SELECT Publisher
    FROM heroes_information
    GROUP BY Publisher
    HAVING COUNT(*) > 15
) AS subquery;

"""

In [34]:
pysqldf(query10)

   COUNT(*)
0         4